<?php $title = 'РосКосМос Банк';

include_once 'parts/head.php'; ?>
    <header>
        <a href="pages/all_statement.php" class="button button_to">← К списку банковских выписок</a>
        <div class="logo">
            <svg class="logo__rocker" viewBox="0 0 137 114" fill="none" xmlns="http://www.w3.org/2000/svg">
                <path d="M136.68 0.216601C134.574 0.0684006 132.519 0 130.498 0C86.7096 0 61.7813 33.3336 52.7108 60.1578L76.7771 84.1833C104.417 74.2995 137 50.331 137 7.0737C137 4.8393 136.863 2.5536 136.68 0.216601ZM79.2659 72.2931L64.5898 57.6384C70.8062 43.1034 88.4792 12.1638 126.696 10.26C125.418 39.6093 106.124 60.7392 79.2659 72.2931ZM107.123 80.1078C104.337 82.0059 101.568 83.7159 98.8341 85.2435C97.8808 89.7693 95.4605 94.6086 91.9555 98.7297C91.9498 95.7999 91.1278 92.8473 89.695 89.8947C87.1777 91.0347 84.7859 92.0208 82.4968 92.8815C85.859 101.568 82.434 107.981 77.8388 114C84.4377 113.504 91.3619 110.278 96.8133 104.829C102.704 98.952 106.831 90.4761 107.123 80.1078ZM46.9453 47.2188C43.9941 45.7995 41.0543 44.9958 38.126 44.9844C42.2131 41.5245 47.0081 39.1191 51.5006 38.1444C53.0989 35.3343 54.897 32.5641 56.7865 29.8395C46.403 30.1188 37.909 34.2513 32.0123 40.128C26.5609 45.5715 23.3357 52.4913 22.8333 59.0748C28.8613 54.4806 35.2946 51.0606 43.9884 54.4293C44.8732 52.0353 45.8493 49.6299 46.9453 47.2188ZM86.3385 50.5875C84.3406 48.6039 84.3406 45.3834 86.3385 43.3998C88.325 41.4162 91.5445 41.4162 93.5368 43.3998C95.529 45.3891 95.529 48.6096 93.5368 50.5932C91.5445 52.5825 88.325 52.5825 86.3385 50.5875ZM111.535 25.4277C107.562 21.4605 101.112 21.4605 97.1387 25.4277C93.16 29.3949 93.16 35.8416 97.1387 39.8088C101.112 43.7817 107.562 43.7817 111.541 39.8088C115.508 35.8416 115.508 29.3949 111.535 25.4277ZM101.814 35.1348C100.427 33.744 100.427 31.4868 101.814 30.1017C103.195 28.7109 105.467 28.7109 106.866 30.1017C108.247 31.4868 108.241 33.744 106.866 35.1348C105.467 36.5199 103.201 36.5199 101.814 35.1348ZM64.7553 86.5716C54.8571 97.0824 43.8857 102.457 32.1037 102.457C13.837 102.457 0 89.0397 0 72.1848C0 63.7203 3.48779 54.3894 11.6621 45.4575C-6.61025 74.7384 18.0897 103.187 49.8737 71.7174L54.2406 76.0779C49.046 82.1256 44.759 87.3468 37.2811 91.1145C44.9531 91.4394 53.664 86.868 60.2115 82.0344L64.7553 86.5716Z"
                      fill="#FF0000"/>
            </svg>
            <p class="logo__text">РосКосМос Банк</p>
        </div>
        <a href="/api/v1/get-all-statements" class="button button_to">Выгрузить все выписки →</a>
    </header>
    <main>
        <h1>Запрос банковской выписки:</h1>
        <form method="post" action="/api/v1/statement" class="main_form">
            <label for="client_name">Имя клиента:</label>
            <input placeholder="Вася Пупкин" name="client_name" type="text">
            <label for="email" for="">Почта клиента:</label>
            <input placeholder="vasyakiller2006@mail.ru" name="email" type="text">
            <label for="">Период:</label>
            <div class="period">
                <label for="date_from">С:</label>
                <input name="date_from" type="date">
                <label for="date_to">По:</label>
                <input name="date_to" type="date">
            </div>
            <input type="hidden" name="request_type" value="request">
            <input type="submit" value="Запросить" class="button button_center">
        </form>
    </main>
<?php include_once 'parts/footer.php';
