<?php

/**
 * Хост и имя базы данных
 */
const DSN_DB = "";

/**
 * Имя пользователя базы данных
 */
const USERNAME_DB = "";

/**
 * Пароль пользователя базы данных
 */
const PASSWORD_DB = "";

/**
 * Путь до проекта
 */
const PROJECT_PATH = "";

/**
 * Массив id администраторов
 */
const ADMIN_ID = [];

/**
 * Адрес сайта
 */
const ADDRESS = '';

/**
 * Тип шаблона, который проходит рендеринг
 */
const VIEW_TYPE = '';

/**
 * Email с которого высылаются сообщения об успешной регистрации
 */
const EMAIL = '';

/**
 * Пароль от email, с которого высылаются сообщения об успешной регистрации
 */
const EMAIL_PASS = '';