INSERT INTO cinema_hall (name)
VALUES
('hall1'),
('hall2')

INSERT INTO film (name, price, duration)
VALUES
('film1', 250, 5440),
('film2', 300, 5530),
('film3', 310, 6120)

INSERT INTO tariff (name, ratio)
VALUES
('Будни утро', 1.1),
('Будни вечер', 1.3),
('Выходной вечер', 1.6)

INSERT INTO cinema_session (hall_id, film_id, tariff_id, start_time)
VALUES
(1, 2, 1, '2021-11-24 18:00:00'),
(2, 1, 3, '2021-11-24 18:00:00'),
(1, 2, 1, '2021-11-24 23:00:00'),
(1, 2, 2, '2021-11-24 20:00:00'),
(2, 3, 3, '2021-11-27 18:00:00'),
(2, 3, 2, '2021-11-23 18:00:00')

INSERT INTO hall_seat (row, seat)
VALUES
(1, 1),(1, 2),(1, 3),(1, 4),(1, 5),(1, 6),
(2, 1),(2, 2),(2, 3),(2, 4),(2, 5),(2, 6),
(3, 1),(3, 2),(3, 3),(3, 4),(3, 5),(3, 6)

INSERT INTO user (name, phone)
VALUES
('Иванов Петр', '78883827321'),
('Иванов Петр1', '78873827321'),
('Иванов Петр2', '74333827321'),
('Иванов Петр3', '78433827321'),
('Иванов Петр4', '78663827321'),
('Иванов Петр5', '78883827451'),
('Иванов Петр6', '78884567321'),
('Иванов Петр7', '74724625321')

INSERT INTO tickets (user_id, seat_id, session_id, total_price)
VALUES
(1, 4, 1, 330),
(2, 5, 2, 400),
(5, 6, 2, 400),
(3, 7, 4, 390),
(6, 8, 6, 403),
(7, 9, 2, 400),
(4, 10, 4, 390),
(8, 16, 5, 496)