<?php

return [
    /**
     * Хост и имя базы данных
     */
    'DSN_DB' => "",

    /**
     * Имя пользователя базы данных
     */
    'USERNAME_DB' => "",

    /**
     * Пароль пользователя базы данных
     */
    'PASSWORD_DB' => "",

    /**
     * Путь до проекта
     */
    'PROJECT_PATH' => "",

    /**
     * Массив id администраторов
     */
    'ADMIN_ID' => [],

    /**
     * Адрес сайта
     */
    'ADDRESS' => '',

    /**
     * Тип шаблона, который проходит рендеринг
     */
    'VIEW_TYPE' => '',

    /**
     * Порт почтового клиента
     */
    'EMAIL_PORT' => '',

    /**
     * Хост почтового клиента
     */
    'EMAIL_HOST' => '',

    /**
     *
     */
    'USERNAME' => '',

    /**
     * Email с которого высылаются сообщения об успешной регистрации
     */
    'EMAIL_TO' => '',

    /**
     * Пароль от email, с которого высылаются сообщения об успешной регистрации
     */
    'EMAIL_PASS' => '',
];
