<?php

return [
    /**
     * Хост и имя базы данных
     */
    'DSN_DB' => "mysql:host=localhost;dbname=oldproject",

    /**
     * Имя пользователя базы данных
     */
    'USERNAME_DB' => "root",

    /**
     * Пароль пользователя базы данных
     */
    'PASSWORD_DB' => "root",

    /**
     * Путь до проекта
     */
    'PROJECT_PATH' => "",

    /**
     * Массив id администраторов
     */
    'ADMIN_ID' => [],

    /**
     * Адрес сайта
     */
    'ADDRESS' => 'bd.local/',

    /**
     * Тип шаблона, который проходит рендеринг
     */
    'VIEW_TYPE' => '',

    /**
     * Порт почтового клиента
     */
    'EMAIL_PORT' => '2525',

    /**
     * Хост почтового клиента
     */
    'EMAIL_HOST' => 'smtp.mailtrap.io',

    /**
     *
     */
    'USERNAME' => 'c3f467bd6ed152',

    /**
     * Email с которого высылаются сообщения об успешной регистрации
     */
    'EMAIL_TO' => 'hugopochta@gmail.com',

    /**
     * Пароль от email, с которого высылаются сообщения об успешной регистрации
     */
    'EMAIL_PASS' => '387e9d29b36b9a',
];
